take 1/app/controllers/store_owners_controller.rb

INSERT INTO "store_owners" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
		def create
		  @store_owner = StoreOwner.create!(owner_params)